results/10k-direct.txt
/ # wrk -t 4 -c 200 -d 60s -R 10000 --latency -s /req-body.lua http://localhost:1980/v1/ch
at/completions
Running 1m test @ http://localhost:1980/v1/chat/completions
  4 threads and 200 connections
  Thread calibration: mean lat.: 0.872ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.072ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.889ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.105ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.00ms  508.50us   7.10ms   67.95%
    Req/Sec     2.62k     1.25k    5.55k    70.86%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.97ms
 75.000%    1.32ms
 90.000%    1.64ms
 99.000%    2.34ms
 99.900%    3.74ms
 99.990%    5.66ms
 99.999%    6.81ms
100.000%    7.10ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.055     0.000000            1         1.00
       0.371     0.100000        49785         1.11
       0.534     0.200000        99540         1.25
       0.687     0.300000       149268         1.43
       0.833     0.400000       199247         1.67
       0.971     0.500000       248961         2.00
       1.039     0.550000       273899         2.22
       1.108     0.600000       298668         2.50
       1.179     0.650000       323670         2.86
       1.251     0.700000       348413         3.33
       1.323     0.750000       373187         4.00
       1.362     0.775000       385571         4.44
       1.405     0.800000       398104         5.00
       1.452     0.825000       410570         5.71
       1.505     0.850000       422881         6.67
       1.568     0.875000       435303         8.00
       1.603     0.887500       441492         8.89
       1.642     0.900000       447720        10.00
       1.685     0.912500       453940        11.43
       1.734     0.925000       460207        13.33
       1.788     0.937500       466379        16.00
       1.819     0.943750       469519        17.78
       1.854     0.950000       472653        20.00
       1.891     0.956250       475734        22.86
       1.935     0.962500       478818        26.67
       1.986     0.968750       481940        32.00
       2.015     0.971875       483491        35.56
       2.047     0.975000       485048        40.00
       2.085     0.978125       486634        45.71
       2.127     0.981250       488131        53.33
       2.185     0.984375       489711        64.00
       2.219     0.985938       490464        71.11
       2.257     0.987500       491260        80.00
       2.301     0.989062       492020        91.43
       2.359     0.990625       492789       106.67
       2.433     0.992188       493563       128.00
       2.485     0.992969       493951       142.22
       2.539     0.993750       494351       160.00
       2.603     0.994531       494730       182.86
       2.683     0.995313       495119       213.33
       2.785     0.996094       495508       256.00
       2.857     0.996484       495701       284.44
       2.939     0.996875       495894       320.00
       3.041     0.997266       496088       365.71
       3.163     0.997656       496287       426.67
       3.279     0.998047       496478       512.00
       3.349     0.998242       496575       568.89
       3.433     0.998437       496674       640.00
       3.523     0.998633       496768       731.43
       3.651     0.998828       496866       853.33
       3.753     0.999023       496963      1024.00
       3.833     0.999121       497011      1137.78
       3.913     0.999219       497060      1280.00
       3.991     0.999316       497110      1462.86
       4.107     0.999414       497159      1706.67
       4.239     0.999512       497206      2048.00
       4.299     0.999561       497230      2275.56
       4.371     0.999609       497255      2560.00
       4.475     0.999658       497278      2925.71
       4.579     0.999707       497303      3413.33
       4.707     0.999756       497327      4096.00
       4.803     0.999780       497340      4551.11
       4.923     0.999805       497351      5120.00
       5.055     0.999829       497363      5851.43
       5.243     0.999854       497376      6826.67
       5.483     0.999878       497388      8192.00
       5.583     0.999890       497394      9102.22
       5.683     0.999902       497401     10240.00
       5.747     0.999915       497406     11702.86
       5.855     0.999927       497412     13653.33
       5.899     0.999939       497418     16384.00
       5.955     0.999945       497421     18204.44
       6.007     0.999951       497424     20480.00
       6.039     0.999957       497427     23405.71
       6.083     0.999963       497430     27306.67
       6.151     0.999969       497433     32768.00
       6.203     0.999973       497435     36408.89
       6.227     0.999976       497436     40960.00
       6.323     0.999979       497438     46811.43
       6.395     0.999982       497439     54613.33
       6.439     0.999985       497441     65536.00
       6.707     0.999986       497442     72817.78
       6.707     0.999988       497442     81920.00
       6.811     0.999989       497443     93622.86
       6.831     0.999991       497444    109226.67
       6.919     0.999992       497445    131072.00
       6.919     0.999993       497445    145635.56
       6.919     0.999994       497445    163840.00
       6.935     0.999995       497446    187245.71
       6.935     0.999995       497446    218453.33
       7.007     0.999996       497447    262144.00
       7.007     0.999997       497447    291271.11
       7.007     0.999997       497447    327680.00
       7.007     0.999997       497447    374491.43
       7.007     0.999998       497447    436906.67
       7.099     0.999998       497448    524288.00
       7.099     1.000000       497448          inf
#[Mean    =        1.001, StdDeviation   =        0.508]
#[Max     =        7.096, Total count    =       497448]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  594428 requests in 1.00m, 270.41MB read
Requests/sec:   9906.69
Transfer/sec:      4.51MB