results/10k-gateway-no-ai-proxy.txt
/ # wrk -t 4 -c 200 -d 60s -R 10000 --latency -s /req-body.lua http://localhost:9080/v1/ch
at/completions
Running 1m test @ http://localhost:9080/v1/chat/completions
  4 threads and 200 connections
  Thread calibration: mean lat.: 1700.330ms, rate sampling interval: 7770ms
  Thread calibration: mean lat.: 1700.723ms, rate sampling interval: 7770ms
  Thread calibration: mean lat.: 2165.095ms, rate sampling interval: 8228ms
  Thread calibration: mean lat.: 2788.660ms, rate sampling interval: 9191ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.66s     6.97s   29.51s    58.26%
    Req/Sec     1.28k    45.41     1.38k    69.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.52s 
 75.000%   22.66s 
 90.000%   26.38s 
 99.000%   28.70s 
 99.900%   29.21s 
 99.990%   29.44s 
 99.999%   29.51s 
100.000%   29.52s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4587.519     0.000000            6         1.00
    7299.071     0.100000        25537         1.11
    9584.639     0.200000        51069         1.25
   11542.527     0.300000        76565         1.43
   13975.551     0.400000       102074         1.67
   16515.071     0.500000       127529         2.00
   17924.095     0.550000       140354         2.22
   19152.895     0.600000       153045         2.50
   20217.855     0.650000       165810         2.86
   21512.191     0.700000       178604         3.33
   22659.071     0.750000       191387         4.00
   23281.663     0.775000       197798         4.44
   23986.175     0.800000       204094         5.00
   24575.999     0.825000       210470         5.71
   25133.055     0.850000       216805         6.67
   25690.111     0.875000       223192         8.00
   26017.791     0.887500       226458         8.89
   26378.239     0.900000       229585        10.00
   26722.303     0.912500       232769        11.43
   27049.983     0.925000       235995        13.33
   27344.895     0.937500       239117        16.00
   27508.735     0.943750       240841        17.78
   27656.191     0.950000       242417        20.00
   27803.647     0.956250       243991        22.86
   27951.103     0.962500       245507        26.67
   28114.943     0.968750       247181        32.00
   28196.863     0.971875       247994        35.56
   28278.783     0.975000       248806        40.00
   28360.703     0.978125       249574        45.71
   28442.623     0.981250       250342        53.33
   28524.543     0.984375       251088        64.00
   28573.695     0.985938       251516        71.11
   28622.847     0.987500       251938        80.00
   28671.999     0.989062       252338        91.43
   28721.151     0.990625       252697       106.67
   28786.687     0.992188       253131       128.00
   28819.455     0.992969       253328       142.22
   28852.223     0.993750       253526       160.00
   28884.991     0.994531       253693       182.86
   28917.759     0.995313       253855       213.33
   28966.911     0.996094       254074       256.00
   28999.679     0.996484       254213       284.44
   29016.063     0.996875       254268       320.00
   29048.831     0.997266       254389       365.71
   29081.599     0.997656       254488       426.67
   29114.367     0.998047       254582       512.00
   29130.751     0.998242       254629       568.89
   29147.135     0.998437       254672       640.00
   29163.519     0.998633       254704       731.43
   29196.287     0.998828       254778       853.33
   29212.671     0.999023       254802      1024.00
   29229.055     0.999121       254834      1137.78
   29245.439     0.999219       254860      1280.00
   29261.823     0.999316       254876      1462.86
   29278.207     0.999414       254901      1706.67
   29310.975     0.999512       254936      2048.00
   29310.975     0.999561       254936      2275.56
   29327.359     0.999609       254951      2560.00
   29343.743     0.999658       254968      2925.71
   29360.127     0.999707       254978      3413.33
   29376.511     0.999756       254990      4096.00
   29392.895     0.999780       255002      4551.11
   29392.895     0.999805       255002      5120.00
   29409.279     0.999829       255013      5851.43
   29409.279     0.999854       255013      6826.67
   29425.663     0.999878       255019      8192.00
   29442.047     0.999890       255029      9102.22
   29442.047     0.999902       255029     10240.00
   29442.047     0.999915       255029     11702.86
   29458.431     0.999927       255036     13653.33
   29458.431     0.999939       255036     16384.00
   29458.431     0.999945       255036     18204.44
   29458.431     0.999951       255036     20480.00
   29474.815     0.999957       255039     23405.71
   29474.815     0.999963       255039     27306.67
   29491.199     0.999969       255044     32768.00
   29491.199     0.999973       255044     36408.89
   29491.199     0.999976       255044     40960.00
   29491.199     0.999979       255044     46811.43
   29491.199     0.999982       255044     54613.33
   29507.583     0.999985       255046     65536.00
   29507.583     0.999986       255046     72817.78
   29507.583     0.999988       255046     81920.00
   29507.583     0.999989       255046     93622.86
   29507.583     0.999991       255046    109226.67
   29523.967     0.999992       255048    131072.00
   29523.967     1.000000       255048          inf
#[Mean    =    16656.762, StdDeviation   =     6969.269]
#[Max     =    29507.584, Total count    =       255048]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  304550 requests in 1.00m, 139.99MB read
Requests/sec:   5075.70
Transfer/sec:      2.33MB